---
kind: method
id: M:Autodesk.Revit.DB.Visual.AssetSet.#ctor
source: html/573899ad-a45e-c59d-d46c-fb4a236af48a.htm
---
# Autodesk.Revit.DB.Visual.AssetSet.#ctor Method

Initializes a new instance of the AssetSet class

## Syntax (C#)
```csharp
public AssetSet()
```